from .tables import L_DOTS

RULE_13_A_ABBREVIATION_DOTS = {
    "ㄱ": "1246",
    "ㄴ": L_DOTS["ㄴ"],
    "ㄷ": L_DOTS["ㄷ"],
    "ㅁ": L_DOTS["ㅁ"],
    "ㅂ": L_DOTS["ㅂ"],
    "ㅅ": "123",
    "ㅈ": L_DOTS["ㅈ"],
    "ㅋ": L_DOTS["ㅋ"],
    "ㅌ": L_DOTS["ㅌ"],
    "ㅍ": L_DOTS["ㅍ"],
    "ㅎ": L_DOTS["ㅎ"],
}

RULE_13_VOWEL_FOLLOWING_EXCEPTION_L = {
    "ㄴ",
    "ㄷ",
    "ㅁ",
    "ㅂ",
    "ㅈ",
    "ㅋ",
    "ㅌ",
    "ㅍ",
    "ㅎ",
}

RULE_15_LVT_ABBREVIATION_DOTS = {
    ("ㄱ", "ㅓ", "ㅅ"): ["456", "234"],
}

RULE_15_VT_ABBREVIATION_DOTS = {
    ("ㅓ", "ㄱ"): "1456",
    ("ㅓ", "ㄴ"): "23456",
    ("ㅓ", "ㄹ"): "2345",
    ("ㅕ", "ㄴ"): "16",
    ("ㅕ", "ㄹ"): "1256",
    ("ㅕ", "ㅇ"): "12456",
    ("ㅗ", "ㄱ"): "1346",
    ("ㅗ", "ㄴ"): "12356",
    ("ㅗ", "ㅇ"): "123456",
    ("ㅜ", "ㄴ"): "1245",
    ("ㅜ", "ㄹ"): "12346",
    ("ㅡ", "ㄴ"): "1356",
    ("ㅡ", "ㄹ"): "2346",
    ("ㅣ", "ㄴ"): "12345",
}

RULE_15_T_CLUSTER_PARTS = {
    "ㄲ": ["ㄱ", "ㄱ"],
    "ㄳ": ["ㄱ", "ㅅ"],
    "ㄵ": ["ㄴ", "ㅈ"],
    "ㄶ": ["ㄴ", "ㅎ"],
    "ㄺ": ["ㄹ", "ㄱ"],
    "ㄻ": ["ㄹ", "ㅁ"],
    "ㄼ": ["ㄹ", "ㅂ"],
    "ㄽ": ["ㄹ", "ㅅ"],
    "ㄾ": ["ㄹ", "ㅌ"],
    "ㄿ": ["ㄹ", "ㅍ"],
    "ㅀ": ["ㄹ", "ㅎ"],
}

RULE_17_ABBREVIATION_DOTS = {
    ("ㅅ", "ㅓ", "ㅇ"): "12456",
    ("ㅆ", "ㅓ", "ㅇ"): "12456",
    ("ㅈ", "ㅓ", "ㅇ"): "12456",
    ("ㅉ", "ㅓ", "ㅇ"): "12456",
    ("ㅊ", "ㅓ", "ㅇ"): "12456",
}
