L_DOTS = {
    "ㄱ": "4",
    "ㄴ": "14",
    "ㄷ": "24",
    "ㄹ": "5",
    "ㅁ": "15",
    "ㅂ": "45",
    "ㅅ": "6",
    "ㅇ": "1245",
    "ㅈ": "46",
    "ㅊ": "56",
    "ㅋ": "124",
    "ㅌ": "125",
    "ㅍ": "145",
    "ㅎ": "245",
}

FULL_SIGN_DOT = "123456"
RULE_10_ATTACHED_T_SIGN_DOT = "456"
VOWEL_SEQUENCE_SEPARATOR_DOT = "36"

RULE_2_L_ㄲㄸㅃㅆㅉ_DOTS = {
    "ㄲ": ["6", L_DOTS["ㄱ"]],
    "ㄸ": ["6", L_DOTS["ㄷ"]],
    "ㅃ": ["6", L_DOTS["ㅂ"]],
    "ㅆ": ["6", L_DOTS["ㅅ"]],
    "ㅉ": ["6", L_DOTS["ㅈ"]],
}

V_DOTS = {
    "ㅏ": "126",
    "ㅑ": "345",
    "ㅓ": "234",
    "ㅕ": "156",
    "ㅗ": "136",
    "ㅛ": "346",
    "ㅜ": "134",
    "ㅠ": "146",
    "ㅡ": "246",
    "ㅚ": "13456",
    "ㅣ": "135",
}

RULE_7_V_CLUSTER_DOTS = {
    "ㅐ": ["1235"],
    "ㅒ": [V_DOTS["ㅑ"], "1235"],
    "ㅔ": ["1345"],
    "ㅖ": ["34"],
    "ㅘ": ["1236"],
    "ㅙ": ["1236", "1235"],
    "ㅚ": ["13456"],
    "ㅝ": ["1234"],
    "ㅞ": ["1234", "1235"],
    "ㅟ": [V_DOTS["ㅜ"], "1235"],
    "ㅢ": ["2456"],
}

RULE_13_L_ㅏ_약자_DOTS = {
    "ㄱ": "1246",
    "ㄴ": L_DOTS["ㄴ"],
    "ㄷ": L_DOTS["ㄷ"],
    "ㅁ": L_DOTS["ㅁ"],
    "ㅂ": L_DOTS["ㅂ"],
    "ㅅ": "123",
    "ㅈ": L_DOTS["ㅈ"],
    "ㅋ": L_DOTS["ㅋ"],
    "ㅌ": L_DOTS["ㅌ"],
    "ㅍ": L_DOTS["ㅍ"],
    "ㅎ": L_DOTS["ㅎ"],
}

RULE_13_L_ㄲㄸㅃㅆㅉ_ㅏ_약자_DOTS = {
    "ㄲ": ["6", RULE_13_L_ㅏ_약자_DOTS["ㄱ"]],
    "ㄸ": ["6", RULE_13_L_ㅏ_약자_DOTS["ㄷ"]],
    "ㅃ": ["6", RULE_13_L_ㅏ_약자_DOTS["ㅂ"]],
    "ㅆ": ["6", RULE_13_L_ㅏ_약자_DOTS["ㅅ"]],
    "ㅉ": ["6", RULE_13_L_ㅏ_약자_DOTS["ㅈ"]],
}

T_DOTS = {
    "ㄱ": "1",
    "ㄴ": "25",
    "ㄷ": "35",
    "ㄹ": "2",
    "ㅁ": "26",
    "ㅂ": "12",
    "ㅅ": "3",
    "ㅇ": "2356",
    "ㅈ": "13",
    "ㅊ": "23",
    "ㅋ": "235",
    "ㅌ": "236",
    "ㅍ": "256",
    "ㅎ": "356",
    "ㅆ": "34",
}

RULE_4_T_ㄲㅆ_DOTS = {
    "ㄲ": [T_DOTS["ㄱ"], T_DOTS["ㄱ"]],
    "ㅆ": [T_DOTS["ㅆ"]],
}

RULE_5_T_CLUSTER_DOTS = {
    "ㄳ": [T_DOTS["ㄱ"], T_DOTS["ㅅ"]],
    "ㄵ": [T_DOTS["ㄴ"], T_DOTS["ㅈ"]],
    "ㄶ": [T_DOTS["ㄴ"], T_DOTS["ㅎ"]],
    "ㄺ": [T_DOTS["ㄹ"], T_DOTS["ㄱ"]],
    "ㄻ": [T_DOTS["ㄹ"], T_DOTS["ㅁ"]],
    "ㄼ": [T_DOTS["ㄹ"], T_DOTS["ㅂ"]],
    "ㄽ": [T_DOTS["ㄹ"], T_DOTS["ㅅ"]],
    "ㄾ": [T_DOTS["ㄹ"], T_DOTS["ㅌ"]],
    "ㄿ": [T_DOTS["ㄹ"], T_DOTS["ㅍ"]],
    "ㅀ": [T_DOTS["ㄹ"], T_DOTS["ㅎ"]],
    "ㅄ": [T_DOTS["ㅂ"], T_DOTS["ㅅ"]],
}

RULE_14_NEXT_L_ㅇ_CANCELS_RULE_13 = {
    "ㄴ",
    "ㄷ",
    "ㅁ",
    "ㅂ",
    "ㅈ",
    "ㅋ",
    "ㅌ",
    "ㅍ",
    "ㅎ",
}

RULE_12_PRECEDING_V = {"ㅑ", "ㅘ", "ㅜ", "ㅝ"}

RULE_15_LVT_약자_DOTS = {
    ("ㄱ", "ㅓ", "ㅅ"): ["456", "234"],
}

RULE_15_VT_약자_DOTS = {
    ("ㅓ", "ㄱ"): "1456",
    ("ㅓ", "ㄴ"): "23456",
    ("ㅓ", "ㄹ"): "2345",
    ("ㅕ", "ㄴ"): "16",
    ("ㅕ", "ㄹ"): "1256",
    ("ㅕ", "ㅇ"): "12456",
    ("ㅗ", "ㄱ"): "1346",
    ("ㅗ", "ㄴ"): "12356",
    ("ㅗ", "ㅇ"): "123456",
    ("ㅜ", "ㄴ"): "1245",
    ("ㅜ", "ㄹ"): "12346",
    ("ㅡ", "ㄴ"): "1356",
    ("ㅡ", "ㄹ"): "2346",
    ("ㅣ", "ㄴ"): "12345",
}

RULE_17_LVT_ABBREVIATIONS = {
    ("ㅅ", "ㅓ", "ㅇ"): "12456",
    ("ㅆ", "ㅓ", "ㅇ"): "12456",
    ("ㅈ", "ㅓ", "ㅇ"): "12456",
    ("ㅉ", "ㅓ", "ㅇ"): "12456",
    ("ㅊ", "ㅓ", "ㅇ"): "12456",
}
